wisteria-1c/Конфигурация/InformationRegisters/СоответствияОбъектовСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоответствияОбъектовСайта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектВыгружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.УдалитьОбменУправлениеНебольшойФирмойСайт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СоответствияОбъектовСайта/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобыимйФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоВариантИнтерфейса85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();

	Элементы.ФормаСнятьОтметкуВыгруженТакси.Видимость = Не ЭтоВариантИнтерфейса85;
	Элементы.ФормаОбновитьТакси.Видимость = Не ЭтоВариантИнтерфейса85;

	Элементы.ФормаСнятьОтметкуВыгружен.Видимость = ЭтоВариантИнтерфейса85;
	Элементы.ФормаОбновить.Видимость = ЭтоВариантИнтерфейса85;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьОтметкуВыгружен(Команда)
	СнятьОтметкуВыгруженНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СнятьОтметкуВыгруженНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	СоответствияОбъектовСайта.УзелИнформационнойБазы,
				   |	СоответствияОбъектовСайта.УникальныйИдентификаторСайта,
				   |	СоответствияОбъектовСайта.СсылкаНаОбъект,
				   |	СоответствияОбъектовСайта.УникальныйИдентификаторИнформационнойБазы,
				   |	ЛОЖЬ КАК ОбъектВыгружен,
				   |	СоответствияОбъектовСайта.ТипОбъекта
				   |ИЗ
				   |	РегистрСведений.СоответствияОбъектовСайта КАК СоответствияОбъектовСайта";

	Результат = Запрос.Выполнить().Выгрузить();

	НЗ = РегистрыСведений.СоответствияОбъектовСайта.СоздатьНаборЗаписей();
	НЗ.Загрузить(Результат);
	НЗ.Записать();
    
    Элементы.Список.Обновить();
    
КонецПроцедуры

#КонецОбласти
